// Координаты палуб кораблей
let location1 = 5
let location2 = 6
let location3 = 7
// Координата выстрела
let currentShot
// Сколько сделано выстрелов
let shots = 0
// Сколько попаданий
let hits = 0
// Потоплен ли корабль?
let isSunk = false

// Цикл игры — работает, пока корабль не потонул
while (isSunk === false) {
// Получаем коордианты выстрела
// Отмечаем, что сделан выстрел
// Проверяем, попал или не попал
// Если не попал, то играем дальше
// Если попал, то увеличиваем hits (счетчик попаданий)
// Если попал 3 раза, то топим корабль и сообщаем игроку о его успехе
}
